
#ifndef ROSE_SgAsmElfSegmentTableEntry_H
#define ROSE_SgAsmElfSegmentTableEntry_H
#include <RoseFirst.h>
#include <Cxx_GrammarDeclarations.h>
#include <SgAsmExecutableFileFormat.h>



/* #line 1 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro" */

// WARNING -- GENERATED CODE -- DO NOT MODIFY THIS CODE -- WARNING!
//      This code is automatically generated for each 
//      terminal and non-terminal within the defined 
//      grammar.  There is a simple way to change the 
//      code to fix bugs etc.  See the ROSE README file
//      for directions.

// tps: (02/22/2010): Adding DLL export requirements
#include "rosedll.h"

// predeclarations for SgAsmElfSegmentTableEntry

/* #line 25 "/workspace/generated/src/frontend/SageIII//SgAsmElfSegmentTableEntry.h" */
/* #line 19972 "/workspace/src/ROSETTA/src/binaryInstruction.C" */

#include <Rose/BinaryAnalysis/Address.h>
#include <Rose/BinaryAnalysis/ByteOrder.h>
#include <sageContainer.h>


/* #line 13 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro after subst for $PREDECLARATIONS" */

/* #line 14 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro" */

#if !defined(DOCUMENTATION)
// Class Definition for SgAsmElfSegmentTableEntry
class ROSE_DLL_API SgAsmElfSegmentTableEntry  : public SgAsmExecutableFileFormat
   {
     public:


/* #line 44 "/workspace/generated/src/frontend/SageIII//SgAsmElfSegmentTableEntry.h" */

          virtual SgNode* copy ( SgCopyHelp& help) const override;
// Start of memberFunctionString
/* #line 20044 "/workspace/src/ROSETTA/src/binaryInstruction.C" */


    //----------------------- Boost serialization for SgAsmElfSegmentTableEntry -----------------------
#ifdef ROSE_ENABLE_BOOST_SERIALIZATION
private:
    friend class boost::serialization::access;

    template<class S>
    void serialize(S &s, const unsigned /*version*/) {
        debugSerializationBegin("SgAsmElfSegmentTableEntry");
        s & BOOST_SERIALIZATION_BASE_OBJECT_NVP(SgAsmExecutableFileFormat);
        s & BOOST_SERIALIZATION_NVP(p_index);
        s & BOOST_SERIALIZATION_NVP(p_type);
        s & BOOST_SERIALIZATION_NVP(p_flags);
        s & BOOST_SERIALIZATION_NVP(p_offset);
        s & BOOST_SERIALIZATION_NVP(p_vaddr);
        s & BOOST_SERIALIZATION_NVP(p_paddr);
        s & BOOST_SERIALIZATION_NVP(p_filesz);
        s & BOOST_SERIALIZATION_NVP(p_memsz);
        s & BOOST_SERIALIZATION_NVP(p_align);
        s & BOOST_SERIALIZATION_NVP(p_extra);
        debugSerializationEnd("SgAsmElfSegmentTableEntry");
    }
#endif // ROSE_ENABLE_BOOST_SERIALIZATION
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // Local types
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
public:
    /** Segment types (host order). All other values are reserved. */
    enum SegmentType {
        PT_NULL         = 0,                        /**< Ignored entry. Other values of entry are undefined. */
        PT_LOAD         = 1,                        /**< Loadable by mapping file contents into memory. */
        PT_DYNAMIC      = 2,                        /**< Dynamic linking information. */
        PT_INTERP       = 3,                        /**< Segment contains NUL-terminated path name of interpreter. */
        PT_NOTE         = 4,                        /**< Auxiliary information. */
        PT_SHLIB        = 5,                        /**< Reserved w/unspecified semantics. Such a file is nonconforming. */
        PT_PHDR         = 6,                        /**< Segment contains the segment table itself (program header array) */
        PT_TLS          = 7,                        /**< Thread local storage. */

        // OS- and Processor-specific ranges
        PT_LOOS         = 0x60000000,               /**< Values reserved for OS-specific semantics */
        PT_HIOS         = 0x6fffffff,
        PT_LOPROC       = 0x70000000,               /**< Values reserved for processor-specific semantics */
        PT_HIPROC       = 0x7fffffff,

        // OS-specific values for GNU/Linux
        PT_GNU_EH_FRAME = 0x6474e550,               /**< GCC .eh_frame_hdr segment */
        PT_GNU_STACK    = 0x6474e551,               /**< Indicates stack executability */
        PT_GNU_RELRO    = 0x6474e552,               /**< Read-only after relocation */
        PT_PAX_FLAGS    = 0x65041580,               /**< Indicates PaX flag markings */

        // OS-specific values for Sun
        PT_SUNWBSS      = 0x6ffffffa,               /**< Sun Specific segment */
        PT_SUNWSTACK    = 0x6ffffffb                /**< Stack segment */
    };

    /** Segment bit flags */
    enum SegmentFlags {
        PF_NONE         = 0,                        /**< Initial value in c'tor */
        PF_RESERVED     = 0x000ffff8,               /**< Reserved bits */
        PF_XPERM        = 0x00000001,               /**< Execute permission */
        PF_WPERM        = 0x00000002,               /**< Write permission */
        PF_RPERM        = 0x00000004,               /**< Read permission */
        PF_OS_MASK      = 0x0ff00000,               /**< os-specific bits */
        PF_PROC_MASK    = 0xf0000000                /**< Processor-specific bits */
    };

#ifdef _MSC_VER
# pragma pack (1)
#endif
    /** File format of an ELF Segment header.
     *
     * Byte order of members depends on e_ident value in file header. This code comes directly from "Executable and
     * Linkable Format (ELF)", Portable Formats Specification, Version 1.1, Tool Interface Standards (TIS) and not from any
     * header file. The 64-bit structure is gleaned from the Linux elf(5) man page. Segment table entries (a.k.a., ELF
     * program headers) either describe process segments or give supplementary info which does not contribute to the
     * process image. */
    struct Elf32SegmentTableEntry_disk {
        uint32_t        p_type;                  /**< 0x00 kind of segment */
        uint32_t        p_offset;                /**< 0x04 file offset */
        uint32_t        p_vaddr;                 /**< 0x08 desired mapped address of segment */
        uint32_t        p_paddr;                 /**< 0x0c physical address where supported (unused by System V) */
        uint32_t        p_filesz;                /**< 0x20 bytes in file (may be zero or other value smaller than p_memsz) */
        uint32_t        p_memsz;                 /**< 0x24 number of bytes when mapped (may be zero) */
        uint32_t        p_flags;                 /**< 0x28 */
        uint32_t        p_align;                 /**< 0x2c alignment for file and memory (0,1=>none); power of two */
    }                                            /* 0x30 */
#if !defined(SWIG) && !defined(_MSC_VER)
    __attribute__((packed))
#endif
    ;

    struct Elf64SegmentTableEntry_disk {
        uint32_t        p_type;         /* 0x00 */
        uint32_t        p_flags;        /* 0x04 */
        uint64_t        p_offset;       /* 0x08 */
        uint64_t        p_vaddr;        /* 0x10 */
        uint64_t        p_paddr;        /* 0x18 */
        uint64_t        p_filesz;       /* 0x20 */
        uint64_t        p_memsz;        /* 0x28 */
        uint64_t        p_align;        /* 0x30 */
    }                                       /* 0x38 */
#if !defined(SWIG) && !defined(_MSC_VER)
    __attribute__((packed))
#endif
    ;
#ifdef _MSC_VER
# pragma pack ()
#endif

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // Properties
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
public:
public:
    /** Property: Index into table.
     *
     *  This is the index of this entry within the ELF segment table. 
     *  
     *  @{ */
    size_t const& get_index() const;
    void set_index(size_t const&);
    /** @} */

public:
    /** Property: Segment type. 
     * 
     * @{ */
    SgAsmElfSegmentTableEntry::SegmentType const& get_type() const;
    void set_type(SgAsmElfSegmentTableEntry::SegmentType const&);
    /** @} */

public:
    /** Property: Segment flags. 
