
#ifndef ROSE_SgAsmDOSFileHeader_H
#define ROSE_SgAsmDOSFileHeader_H
#include <RoseFirst.h>
#include <Cxx_GrammarDeclarations.h>
#include <SgAsmGenericHeader.h>



/* #line 1 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro" */

// WARNING -- GENERATED CODE -- DO NOT MODIFY THIS CODE -- WARNING!
//      This code is automatically generated for each 
//      terminal and non-terminal within the defined 
//      grammar.  There is a simple way to change the 
//      code to fix bugs etc.  See the ROSE README file
//      for directions.

// tps: (02/22/2010): Adding DLL export requirements
#include "rosedll.h"

// predeclarations for SgAsmDOSFileHeader

/* #line 25 "/workspace/generated/src/frontend/SageIII//SgAsmDOSFileHeader.h" */
/* #line 28470 "/workspace/src/ROSETTA/src/binaryInstruction.C" */

#include <Rose/BinaryAnalysis/Address.h>


/* #line 13 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro after subst for $PREDECLARATIONS" */

/* #line 14 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro" */

#if !defined(DOCUMENTATION)
// Class Definition for SgAsmDOSFileHeader
class ROSE_DLL_API SgAsmDOSFileHeader  : public SgAsmGenericHeader
   {
     public:


/* #line 42 "/workspace/generated/src/frontend/SageIII//SgAsmDOSFileHeader.h" */

          virtual SgNode* copy ( SgCopyHelp& help) const override;
// Start of memberFunctionString
/* #line 28579 "/workspace/src/ROSETTA/src/binaryInstruction.C" */


    //----------------------- Boost serialization for SgAsmDOSFileHeader -----------------------
#ifdef ROSE_ENABLE_BOOST_SERIALIZATION
private:
    friend class boost::serialization::access;

    template<class S>
    void serialize(S &s, const unsigned /*version*/) {
        debugSerializationBegin("SgAsmDOSFileHeader");
        s & BOOST_SERIALIZATION_BASE_OBJECT_NVP(SgAsmGenericHeader);
        s & BOOST_SERIALIZATION_NVP(p_e_last_page_size);
        s & BOOST_SERIALIZATION_NVP(p_e_total_pages);
        s & BOOST_SERIALIZATION_NVP(p_e_nrelocs);
        s & BOOST_SERIALIZATION_NVP(p_e_header_paragraphs);
        s & BOOST_SERIALIZATION_NVP(p_e_minalloc);
        s & BOOST_SERIALIZATION_NVP(p_e_maxalloc);
        s & BOOST_SERIALIZATION_NVP(p_e_ss);
        s & BOOST_SERIALIZATION_NVP(p_e_sp);
        s & BOOST_SERIALIZATION_NVP(p_e_cksum);
        s & BOOST_SERIALIZATION_NVP(p_e_ip);
        s & BOOST_SERIALIZATION_NVP(p_e_cs);
        s & BOOST_SERIALIZATION_NVP(p_e_overlay);
        s & BOOST_SERIALIZATION_NVP(p_e_relocs_offset);
        s & BOOST_SERIALIZATION_NVP(p_e_res1);
        s & BOOST_SERIALIZATION_NVP(p_relocs);
        s & BOOST_SERIALIZATION_NVP(p_rm_section);
        debugSerializationEnd("SgAsmDOSFileHeader");
    }
#endif // ROSE_ENABLE_BOOST_SERIALIZATION
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // Local types
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
public:
#ifdef _MSC_VER
# pragma pack (1)
#endif
    /** On-disk format of DOS file header. */
    struct DOSFileHeader_disk {
        unsigned char e_magic[2];                /**< 0x00 "MZ" */
        uint16_t      e_last_page_size;          /**< 0x02 bytes used on last page of file (1 page == 512 bytes);
                                                  *        zero implies if last page is full. */ //
        uint16_t      e_total_pages;             /**< 0x04 number of pages (inc. last possibly partial page) in file. */
        uint16_t      e_nrelocs;                 /**< 0x06 number of relocation entries stored after this header. */
        uint16_t      e_header_paragraphs;       /**< 0x08 header size in paragraphs (16-byte blocks) inc. relocations. */
        uint16_t      e_minalloc;                /**< 0x0a number of extra paragraphs needed, similar to BSS in Unix. */
        uint16_t      e_maxalloc;                /**< 0x0c max paragraphs to allocate for BSS. */
        uint16_t      e_ss;                      /**< 0x0e initial value of SS register relative to program load segment. */
        uint16_t      e_sp;                      /**< 0x10 initial value for SP register. */
        uint16_t      e_cksum;                   /**< 0x12 checksum; 16-bit sum of all words in file should be zero
                                                  *        (usually not filled in). */
        uint16_t      e_ip;                      /**< 0x14 initial value for IP register. */
        uint16_t      e_cs;                      /**< 0x16 initial value for CS register relative to program load segment. */
        uint16_t      e_relocs_offset;           /**< 0x18 file address of relocation table. */
        uint16_t      e_overlay;                 /**< 0x1a overlay number (zero indicates main program). */
        uint32_t      e_res1;                    /**< 0x1c unknown purpose. */
    }                                            /* 0x20 */
#if !defined(SWIG) && !defined(_MSC_VER)
    __attribute__((packed))
#endif
    ;

    struct DOSRelocEntry_disk {
        uint16_t      offset;                       /* 0x00 */
        uint16_t      segment;                      /* 0x02 */
    }                                               /* 0x04 */
#if !defined(SWIG) && !defined(_MSC_VER)
    __attribute__((packed))
#endif
    ;

#ifdef _MSC_VER
# pragma pack ()
#endif

    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // Properties
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
public:
public:
    /** Property: Last page size.
     *
     *  See DOS specification. 
     *  
     *  @{ */
    uint16_t const& get_e_last_page_size() const;
    void set_e_last_page_size(uint16_t const&);
    /** @} */

public:
    /** Property: Total number of pages.
     *
     *  See DOS specification. 
     *  
     *  @{ */
    uint16_t const& get_e_total_pages() const;
    void set_e_total_pages(uint16_t const&);
    /** @} */

public:
