
#ifndef ROSE_SgAsmLEFileHeader_H
#define ROSE_SgAsmLEFileHeader_H
#include <RoseFirst.h>
#include <Cxx_GrammarDeclarations.h>
#include <SgAsmGenericHeader.h>



/* #line 1 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro" */

// WARNING -- GENERATED CODE -- DO NOT MODIFY THIS CODE -- WARNING!
//      This code is automatically generated for each 
//      terminal and non-terminal within the defined 
//      grammar.  There is a simple way to change the 
//      code to fix bugs etc.  See the ROSE README file
//      for directions.

// tps: (02/22/2010): Adding DLL export requirements
#include "rosedll.h"

// predeclarations for SgAsmLEFileHeader

/* #line 25 "/workspace/generated/src/frontend/SageIII//SgAsmLEFileHeader.h" */
/* #line 8312 "/workspace/src/ROSETTA/src/binaryInstruction.C" */

#include <Rose/BinaryAnalysis/Address.h>
#include <Rose/BinaryAnalysis/ByteOrder.h>

#ifdef ROSE_SgAsmLEFileHeader_IMPL
#include <SgAsmDOSExtendedHeader.h>
#include <SgAsmLEEntryTable.h>
#include <SgAsmLENameTable.h>
#include <SgAsmLEPageTable.h>
#include <SgAsmLERelocTable.h>
#include <SgAsmLESectionTable.h>
#endif


/* #line 13 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro after subst for $PREDECLARATIONS" */

/* #line 14 "/workspace/generated/src/ROSETTA/Grammar/grammarClassDeclarationMacros.macro" */

#if !defined(DOCUMENTATION)
// Class Definition for SgAsmLEFileHeader
class ROSE_DLL_API SgAsmLEFileHeader  : public SgAsmGenericHeader
   {
     public:


/* #line 52 "/workspace/generated/src/frontend/SageIII//SgAsmLEFileHeader.h" */

          virtual SgNode* copy ( SgCopyHelp& help) const override;
// Start of memberFunctionString
/* #line 8649 "/workspace/src/ROSETTA/src/binaryInstruction.C" */


    //----------------------- Boost serialization for SgAsmLEFileHeader -----------------------
#ifdef ROSE_ENABLE_BOOST_SERIALIZATION
private:
    friend class boost::serialization::access;

    template<class S>
    void serialize(S &s, const unsigned /*version*/) {
        debugSerializationBegin("SgAsmLEFileHeader");
        s & BOOST_SERIALIZATION_BASE_OBJECT_NVP(SgAsmGenericHeader);
        s & BOOST_SERIALIZATION_NVP(p_e_byte_order);
        s & BOOST_SERIALIZATION_NVP(p_e_word_order);
        s & BOOST_SERIALIZATION_NVP(p_e_format_level);
        s & BOOST_SERIALIZATION_NVP(p_e_cpu_type);
        s & BOOST_SERIALIZATION_NVP(p_e_os_type);
        s & BOOST_SERIALIZATION_NVP(p_e_module_version);
        s & BOOST_SERIALIZATION_NVP(p_e_flags);
        s & BOOST_SERIALIZATION_NVP(p_e_eip_section);
        s & BOOST_SERIALIZATION_NVP(p_e_esp_section);
        s & BOOST_SERIALIZATION_NVP(p_e_last_page_size);
        s & BOOST_SERIALIZATION_NVP(p_e_page_offset_shift);
        s & BOOST_SERIALIZATION_NVP(p_e_fixup_sect_cksum);
        s & BOOST_SERIALIZATION_NVP(p_e_loader_sect_cksum);
        s & BOOST_SERIALIZATION_NVP(p_e_secttab_nentries);
        s & BOOST_SERIALIZATION_NVP(p_e_rsrctab_nentries);
        s & BOOST_SERIALIZATION_NVP(p_e_fmtdirtab_nentries);
        s & BOOST_SERIALIZATION_NVP(p_e_import_modtab_nentries);
        s & BOOST_SERIALIZATION_NVP(p_e_preload_npages);
        s & BOOST_SERIALIZATION_NVP(p_e_nonresnametab_size);
        s & BOOST_SERIALIZATION_NVP(p_e_nonresnametab_cksum);
        s & BOOST_SERIALIZATION_NVP(p_e_auto_ds_section);
        s & BOOST_SERIALIZATION_NVP(p_e_debug_info_size);
        s & BOOST_SERIALIZATION_NVP(p_e_num_instance_preload);
        s & BOOST_SERIALIZATION_NVP(p_e_num_instance_demand);
        s & BOOST_SERIALIZATION_NVP(p_e_heap_size);
        s & BOOST_SERIALIZATION_NVP(p_e_npages);
        s & BOOST_SERIALIZATION_NVP(p_e_eip);
        s & BOOST_SERIALIZATION_NVP(p_e_esp);
        s & BOOST_SERIALIZATION_NVP(p_e_page_size);
        s & BOOST_SERIALIZATION_NVP(p_e_fixup_sect_size);
        s & BOOST_SERIALIZATION_NVP(p_e_loader_sect_size);
        s & BOOST_SERIALIZATION_NVP(p_e_secttab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_pagetab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_iterpages_offset);
        s & BOOST_SERIALIZATION_NVP(p_e_rsrctab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_resnametab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_entrytab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_fmtdirtab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_fixup_pagetab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_fixup_rectab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_import_modtab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_import_proctab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_ppcksumtab_rfo);
        s & BOOST_SERIALIZATION_NVP(p_e_data_pages_offset);
        s & BOOST_SERIALIZATION_NVP(p_e_nonresnametab_offset);
        s & BOOST_SERIALIZATION_NVP(p_e_debug_info_rfo);
        s & BOOST_SERIALIZATION_NVP(p_dos2Header);
        s & BOOST_SERIALIZATION_NVP(p_sectionTable);
        s & BOOST_SERIALIZATION_NVP(p_pageTable);
        s & BOOST_SERIALIZATION_NVP(p_residentNameTable);
        s & BOOST_SERIALIZATION_NVP(p_nonresidentNameTable);
        s & BOOST_SERIALIZATION_NVP(p_entryTable);
        s & BOOST_SERIALIZATION_NVP(p_relocationTable);
        debugSerializationEnd("SgAsmLEFileHeader");
    }
#endif // ROSE_ENABLE_BOOST_SERIALIZATION
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // Local types
    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
public:
#ifdef _MSC_VER
# pragma pack (1)
#endif
    /* File format of an LE/LX File Header (they are identical except bytes 0x2c-0x2f) */
    struct LEFileHeader_disk {
        unsigned char e_magic[2];           /* 0x00 magic number "LX" */
        unsigned char e_byte_order;         /* 0x02 byte order (0=>little endian; otherwise big endian) */
        unsigned char e_word_order;         /* 0x03 word order (0=>little endian; otherwise big endian) */
        uint32_t    e_format_level;         /* 0x04 LX file format version number */
        uint16_t    e_cpu_type;             /* 0x08 1=>80286, 2=>80386, 3=>80486,4=80586, etc. (see ctor) */
        uint16_t    e_os_type;              /* 0x0a 0=>unknown, 1=>0S/2, 2=>Windows, 3=>DOS 4.x, 4=>Windows 386 */
        uint32_t    e_module_version;       /* 0x0c user-specified module version number */
        uint32_t    e_flags;                /* 0x10 bit flags (see LXFileHeaderFlags) */
        uint32_t    e_npages;               /* 0x14 number of physically contained pages (see e_page_size) */
        uint32_t    e_eip_section;          /* 0x18 the section number to which e_eip is relative */
        uint32_t    e_eip;                  /* 0x1c entry address relative to e_eip_section */
        uint32_t    e_esp_section;          /* 0x20 the section number to which e_esp is relative */
        uint32_t    e_esp;                  /* 0x24 starting stack address relative to e_esp_section */
        uint32_t    e_page_size;            /* 0x28 page size in bytes */
        uint32_t    e_lps_or_shift;         /* 0x2c size of last page (LE) or shift for page table's page offset field (LX) */
        uint32_t    e_fixup_sect_size;      /* 0x30 total size of fixup info in bytes (fixup page/record tables + import names) */
        uint32_t    e_fixup_sect_cksum;     /* 0x34 cryptographic checksum of all fixup info, or zero */
        uint32_t    e_loader_sect_size;     /* 0x38 size of memory resident tables (section table through per-page checksum table) */
        uint32_t    e_loader_sect_cksum;    /* 0x3c cryptographic checksum for all loader info, or zero */
        uint32_t    e_secttab_rfo;          /* 0x40 offset of section table relative to this header */
        uint32_t    e_secttab_nentries;     /* 0x44 number of entries in section table */
        uint32_t    e_pagetab_rfo;          /* 0x48 section page table offset relative to this header */
        uint32_t    e_iterpages_offset;     /* 0x4c section iterated pages offset (absolute file offset) */
        uint32_t    e_rsrctab_rfo;          /* 0x50 offset of resource table relative to this header */
        uint32_t    e_rsrctab_nentries;     /* 0x54 number of entries in the resource table */
        uint32_t    e_resnametab_rfo;       /* 0x58 offset of resident name table relative to this header */
        uint32_t    e_entrytab_rfo;         /* 0x5c offset of entry table relative to this header */
        uint32_t    e_fmtdirtab_rfo;        /* 0x60 offset of module format directives relative to this header */
        uint32_t    e_fmtdirtab_nentries;   /* 0x64 number of entries in module format directives table */
        uint32_t    e_fixup_pagetab_rfo;    /* 0x68 offset of fixup page table relative to this header */
        uint32_t    e_fixup_rectab_rfo;     /* 0x6c offset of fixup record table relative to this header */
        uint32_t    e_import_modtab_rfo;    /* 0x70 offset of import module name table relative to this header */
        uint32_t    e_import_modtab_nentries;/*0x74 number of entries in import module name table */
        uint32_t    e_import_proctab_rfo;   /* 0x78 offset of import procedure name table relative to this header */
        uint32_t    e_ppcksumtab_rfo;       /* 0x7c offset of per-page checksum table relative to this header */
        uint32_t    e_data_pages_offset;    /* 0x80 offset of data pages (absolute file offset) */
        uint32_t    e_preload_npages;       /* 0x84 number of preload pages (not respected by OS/2) */
        uint32_t    e_nonresnametab_offset; /* 0x88 offset of non-resident name table (absolute file offset) */
        uint32_t    e_nonresnametab_size;   /* 0x8c size of non-resident name table in bytes */
        uint32_t    e_nonresnametab_cksum;  /* 0x90 cryptographic checksum of the non-resident name table */
        uint32_t    e_auto_ds_section;      /* 0x94 auto data segment section number (not used by 32-bit modules) */
        uint32_t    e_debug_info_rfo;       /* 0x98 offset of debug information relative to this header */
        uint32_t    e_debug_info_size;      /* 0x9c size of debug information in bytes */
        uint32_t    e_num_instance_preload; /* 0xa0 number of instance data pages found in the preload section */
        uint32_t    e_num_instance_demand;  /* 0xa4 number of instance data pages found in the demand section */
        uint32_t    e_heap_size;            /* 0xa8 number of bytes added to auto data segment by loader (not used by 32-bit) */
    }                                       /* 0xac */
// DQ (3/7/2013): Adding support to restrict visability to SWIG.
#ifndef SWIG
#ifndef _MSC_VER
          __attribute__((packed))
#endif
#endif
          ;
#ifdef _MSC_VER
# pragma pack ()
#endif

    enum LEFileHeaderFlags {
        HF_RESERVED         = 0xbffc5ccb,   /* Reserved bits */
        HF_PROC_LIB_INIT    = 0x00000004,   /* Per-process library initialization; not used for executables */
        HF_IFIXUPS_APPLIED  = 0x00000010,   /* Sections have preferred load addresses and internal relocs have been applied */
        HF_EFIXUPS_APPLIED  = 0x00000020,   /* External fixups for the module have been applied */
        HF_PM_WINDOW_NO     = 0x00000100,   /* Incompatible with PM windowing */
        HF_PM_WINDOW_OK     = 0x00000200,   /* Compatible with PM windowing */
